benchmark/FieldExamples/poissonFlowMultiplePatches/OF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)   // 0
    (3 0 0)   // 1
    (7 0 0)   // 2
    (10 0 0)  // 3
    
    (0 1 0)   // 4
    (3 1 0)   // 5
    (7 1 0)   // 6
    (10 1 0)  // 7
    
    (0 0 0.1)   // 8
    (3 0 0.1)   // 9
    (7 0 0.1)   // 10
    (10 0 0.1)  // 11
    
    (0 1 0.1)   // 12
    (3 1 0.1)   // 13
    (7 1 0.1)   // 14
    (10 1 0.1)  // 15
);

blocks          
(
    hex (0 1 5 4 8 9 13 12) allCells (60 20 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13) allCells (80 20 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) allCells (60 20 1) simpleGrading (1 1 1)
);


boundary 
( 
inlet
{
 type inlet;
 faces
 (
   (0 8 12 4)
 );   
}

outlet
{
 type patch;
 faces
 (
   (7 15 11 3) 
 );   
}

top1
{
 type wall;
 faces
 (
   (5 4 12 13)
 );   
}

top2
{
 type wall;
 faces
 (
   (6 5 13 14)
 );   
}

top3
{
 type wall;
 faces
 (
   (7 6 14 15)
 );   
}

bottom1
{
 type wall;
 faces
 (
   (0 1 9 8) 
 );   
}

bottom2
{
 type wall;
 faces
 (
   (1 2 10 9) 
 );   
}

bottom3
{
 type wall;
 faces
 (
   (2 3 11 10) 
 );   
}

frontback
{
 type empty;
 faces
 (
   (8 9 13 12)
   (9 10 14 13) 
   (10 11 15 14) 
   (1 0 4 5) 
   (2 1 5 6) 
   (3 2 6 7) 
 );   
}
);

// ************************************************************************* //
