benchmark/FieldExamples/poissonFlowMultiplePatches/OF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    top1
    {
        type            zeroGradient;
    }
    
    bottom1
    {
        type            zeroGradient;
    }
    
    top2
    {
        type            zeroGradient;
    }
    
    bottom2
    {
        type            zeroGradient;
    }
    
    top3
    {
        type            zeroGradient;
    }
    
    bottom3
    {
        type            zeroGradient;
    }
    
    frontback
    {
    	type            empty;
    }
}


// ************************************************************************* //
